{"[45, 48, 50, 54]": 1, "[45, 48, 52]": 2, "[48, 52, 55]": 3, "[43, 47, 50]": 4, "[50, 54, 57]": 5, "[40, 43, 47]": 6, "[38, 41, 45]": 7, "[40, 45, 48]": 8, "[48, 52, 57]": 9, "[47, 51, 56]": 10, "[46, 50, 55]": 11, "[44, 47, 52]": 12, "[43, 46, 51]": 13, "[39, 42, 47]": 14, "[47, 51, 54]": 15, "[45, 50, 53]": 16, "[40, 44, 47]": 17, "[]": 18, "[42, 47, 51]": 19, "[41, 45, 50]": 20, "[40, 44, 47, 50]": 21, "[41, 44, 48]": 22, "[36, 38, 41, 45]": 23, "[46, 50, 53]": 24, "[45, 49, 52]": 25, "[45, 50, 52]": 26, "[41, 45, 48, 50]": 27, "[45, 47, 51, 54]": 28, "[45, 48, 52, 55]": 29, "[53, 57, 60]": 30, "[41, 45, 48]": 31, "[50, 53, 57]": 32, "[41, 45, 48, 52]": 33, "[43, 48, 50]": 34, "[36, 40, 43]": 35, "[43, 47, 50, 53]": 36, "[33, 36, 40]": 37, "[43, 47, 52]": 38, "[43, 46, 50, 53]": 39, "[36, 40, 43, 46]": 40, "[44, 50]": 41, "[43, 48, 52]": 42, "[38, 42, 45, 48]": 43, "[45, 48, 52, 54]": 44, "[31, 35, 38]": 45, "[40, 43, 48]": 46, "[38, 41, 45, 48]": 47, "[32, 38]": 48, "[36, 40, 43, 47]": 49, "[33, 36, 40, 43]": 50, "[40, 43, 47, 50]": 51, "[38, 41, 43, 47]": 52, "[42, 45, 50]": 53, "[52, 56, 59, 62]": 54, "[44, 48, 51]": 55, "[48, 51, 55]": 56, "[34, 38, 41]": 57, "[49, 52, 57]": 58, "[40, 45, 47]": 59, "[48, 51, 55, 58]": 60, "[48, 53, 57]": 61, "[41, 46, 48]": 62, "[43, 45, 48, 52]": 63, "[33, 38, 42]": 64, "[47, 50, 55]": 65, "[45, 49, 52, 56]": 66, "[48, 52, 55, 57]": 67, "[52, 55, 59, 62]": 68, "[31, 33, 36]": 69, "[48, 52, 55, 59]": 70, "[47, 53]": 71, "[40, 44, 48, 50]": 72, "[38, 42, 45]": 73, "[44, 47, 51]": 74, "[45, 48, 53]": 75, "[50, 55, 59]": 76, "[43, 47, 50, 52]": 77, "[50, 53, 57, 60]": 78, "[47, 52, 55]": 79, "[48, 53, 55]": 80, "[35, 38, 43]": 81, "[38, 40, 43]": 82, "[38, 43, 47]": 83, "[38, 42, 45, 49]": 84, "[45, 52, 55]": 85, "[45, 49, 52, 55]": 86, "[42, 45, 48, 52]": 87, "[43, 47, 53, 57, 60]": 88, "[43, 50, 53]": 89, "[48, 50, 53]": 90, "[43, 45, 50]": 91, "[33, 35, 40]": 92, "[36, 38, 43]": 93, "[48, 52, 55, 58]": 94, "[53, 55, 60]": 95, "[52, 55, 59]": 96, "[47, 48, 52, 55]": 97, "[46, 48, 52, 55]": 98, "[42, 48]": 99, "[41, 44, 48, 51]": 100, "[46, 50, 53, 57]": 101, "[36, 40, 45]": 102, "[37, 40, 45]": 103, "[52, 55, 60]": 104, "[39, 43, 46]": 105, "[39, 43, 46, 48]": 106, "[33, 37, 40]": 107, "[33, 35, 38, 41]": 108, "[33, 37, 40, 43]": 109, "[33, 40, 43]": 110, "[33, 38, 41]": 111, "[42, 45, 51]": 112, "[41, 43, 48]": 113, "[51, 55, 58]": 114, "[53, 56, 60]": 115, "[52, 57, 60]": 116, "[53, 57, 60, 64]": 117, "[45, 47, 50]": 118, "[49, 51, 54]": 119, "[46, 48, 53]": 120, "[45, 47, 52]": 121, "[42, 46, 52, 56, 59]": 122, "[47, 52, 54]": 123, "[36, 42]": 124, "[39, 43, 46, 50]": 125, "[35, 40, 44]": 126, "[38, 40, 44, 47]": 127, "[50, 55, 58]": 128, "[44, 48, 51, 55]": 129, "[45, 48, 54]": 130, "[47, 50, 53, 57]": 131, "[45, 48, 55, 59, 62]": 132, "[42, 45, 49]": 133, "[38, 40, 45]": 134, "[36, 41, 43]": 135, "[41, 47]": 136, "[45, 48, 51, 55]": 137, "[42, 46, 49]": 138, "[40, 42, 46, 49]": 139, "[38, 43, 46]": 140, "[33, 38, 40]": 141, "[36, 41, 45]": 142, "[35, 40, 43]": 143, "[50, 53, 56, 60]": 144, "[41, 46, 50]": 145, "[50, 55, 57]": 146, "[51, 56, 60]": 147, "[45, 48, 50, 53]": 148, "[46, 49, 51, 55]": 149, "[51, 55, 58, 61]": 150, "[53, 56, 61]": 151, "[35, 38, 42]": 152, "[44, 48, 53]": 153, "[38, 41, 48, 52]": 154, "[38, 43, 45]": 155, "[38, 45, 48]": 156, "[41, 43, 47, 50]": 157, "[51, 53, 57, 60]": 158, "[43, 47, 48, 52]": 159, "[40, 43, 46, 48]": 160, "[43, 46, 50]": 161, "[44, 48, 51, 53]": 162, "[33, 36, 41]": 163, "[44, 47, 50, 52]": 164, "[43, 45, 49, 52]": 165, "[46, 52]": 166, "[41, 44, 50]": 167, "[48, 50, 55]": 168, "[51, 56, 58]": 169, "[49, 53, 56]": 170, "[42, 46, 51]": 171, "[47, 52, 57]": 172, "[39, 43, 45, 48]": 173, "[34, 38, 45, 48]": 174, "[52, 55, 57, 60]": 175, "[47, 52, 56]": 176, "[49, 53, 56, 60]": 177, "[52, 56, 59]": 178, "[46, 50, 53, 56]": 179, "[42, 47, 50]": 180, "[38, 41, 47]": 181, "[38, 40, 43, 47]": 182, "[48, 59, 62, 65]": 183, "[45, 50, 54]": 184, "[42, 45, 49, 50]": 185, "[43, 45, 48]": 186, "[47, 53, 57]": 187, "[43, 48, 51]": 188, "[33, 36, 39, 43]": 189, "[45, 51, 55]": 190, "[35, 39, 42]": 191, "[32, 36, 39, 43]": 192, "[42, 46, 49, 52]": 193, "[47, 50, 53, 55]": 194, "[43, 49]": 195, "[44, 48, 50, 53]": 196, "[53, 57, 62]": 197, "[53, 57, 59, 62]": 198, "[53, 55, 59, 62]": 199, "[48, 50, 53, 56]": 200, "[53, 56, 60, 62]": 201, "[48, 50, 53, 57]": 202, "[50, 53, 57, 59]": 203, "[51, 57]": 204, "[42, 45, 47, 51]": 205, "[50, 53, 55, 59]": 206, "[40, 41, 45, 48]": 207, "[40, 47, 50]": 208, "[45, 49, 52, 54]": 209, "[46, 50, 53, 55]": 210, "[33, 36, 40, 42]": 211, "[42, 45, 48, 50]": 212, "[39, 43, 48]": 213, "[31, 35, 40]": 214, "[34, 38, 41, 44]": 215, "[35, 41]": 216, "[32, 35, 40]": 217, "[49, 55]": 218, "[39, 42, 45, 47]": 219, "[47, 51, 54, 57]": 220, "[50, 53, 58]": 221, "[50, 53, 59]": 222, "[43, 47, 54, 57]": 223, "[39, 43, 49, 53, 56]": 224, "[50, 54, 60, 64, 67]": 225, "[44, 47, 50, 54]": 226, "[41, 44, 48, 50]": 227, "[35, 38, 42, 43]": 228, "[36, 39, 43]": 229, "[43, 46, 52]": 230, "[40, 44, 47, 51]": 231, "[48, 55, 59]": 232, "[49, 53, 60, 63]": 233, "[53, 57, 64, 67]": 234, "[39, 45]": 235, "[38, 41, 44, 48]": 236, "[38, 44]": 237, "[33, 36, 38, 42]": 238, "[43, 46, 48, 52]": 239, "[41, 43, 46, 50]": 240, "[40, 43, 45, 49]": 241, "[32, 36, 38, 41]": 242, "[31, 36, 38]": 243, "[41, 45, 48, 51]": 244, "[37, 43]": 245, "[35, 36, 40, 43]": 246, "[44, 46, 50, 53]": 247, "[36, 38, 42, 45]": 248, "[35, 38, 42, 45]": 249, "[50, 54, 57, 60]": 250, "[45, 48, 55, 59]": 251, "[41, 45, 52, 55]": 252, "[50, 53, 60, 64]": 253, "[45, 48, 52, 53]": 254, "[43, 47, 50, 54]": 255, "[50, 54, 57, 61]": 256, "[35, 38, 40, 43]": 257, "[41, 43, 47]": 258, "[41, 44, 49]": 259, "[52, 57, 59]": 260, "[35, 38, 41, 45]": 261, "[32, 36, 41]": 262, "[45, 47, 50, 53]": 263, "[41, 45, 47, 50]": 264, "[40, 43, 45, 48]": 265, "[47, 50, 52, 55]": 266, "[47, 50, 52, 56]": 267, "[50, 52, 56, 59]": 268, "[53, 59]": 269, "[37, 41, 44]": 270, "[45, 52, 56]": 271, "[48, 53, 56]": 272, "[50, 57, 60]": 273, "[53, 56, 60, 63]": 274, "[31, 34, 38]": 275, "[38, 42, 47]": 276, "[37, 40, 44]": 277, "[32, 36, 39]": 278, "[40, 44, 49]": 279, "[51, 54, 57, 59]": 280, "[52, 55, 57, 61]": 281, "[48, 54]": 282, "[40, 43, 47, 48]": 283, "[48, 55, 58]": 284, "[47, 50, 54]": 285, "[49, 52, 56, 58]": 286, "[39, 43, 50, 53]": 287, "[31, 36, 40]": 288, "[31, 38, 41]": 289, "[33, 36, 40, 41]": 290, "[34, 38, 43]": 291, "[44, 47, 51, 54]": 292, "[46, 48, 51, 55]": 293, "[45, 50, 55]": 294, "[52, 54, 59]": 295, "[50, 52, 57]": 296, "[48, 52, 59, 62]": 297, "[50, 56]": 298, "[52, 55, 62, 65]": 299, "[43, 46, 53, 57]": 300, "[34, 36, 41]": 301, "[33, 36, 43, 47, 50]": 302, "[34, 38, 41, 45]": 303, "[38, 41, 48, 52, 55]": 304, "[40, 42, 47]": 305, "[41, 48, 52]": 306, "[31, 38, 40]": 307, "[31, 35, 38, 41]": 308, "[36, 40, 47, 50]": 309, "[36, 39, 46, 50, 53]": 310, "[39, 43, 49]": 311, "[44, 48, 55, 58]": 312, "[35, 38, 44]": 313, "[47, 50, 53]": 314, "[43, 46, 50, 52]": 315, "[33, 36, 42]": 316, "[35, 40, 45]": 317, "[40, 42, 45, 48]": 318, "[31, 35, 38, 40]": 319, "[38, 41, 46]": 320, "[35, 38, 41, 43]": 321, "[42, 46, 49, 53]": 322, "[46, 49, 53]": 323, "[51, 54, 58, 61]": 324, "[44, 48, 51, 54]": 325, "[45, 51]": 326, "[36, 39, 43, 46]": 327, "[36, 37, 41, 44]": 328, "[36, 40, 43, 45]": 329, "[34, 37, 41, 44]": 330, "[47, 50, 54, 57]": 331, "[53, 57, 60, 62]": 332, "[37, 40, 42, 45]": 333, "[37, 42, 45]": 334, "[40, 45, 49]": 335, "[31, 33, 36, 40]": 336, "[38, 45, 47]": 337, "[37, 40, 44, 47]": 338, "[52, 58]": 339, "[40, 46]": 340, "[41, 43, 46]": 341, "[31, 34, 38, 41]": 342, "[40, 43, 49]": 343, "[48, 50, 54, 57]": 344, "[45, 47, 50, 54]": 345, "[43, 50, 52]": 346, "[43, 47, 49, 52]": 347, "[40, 43, 46, 50]": 348, "[53, 57, 60, 63]": 349, "[52, 59, 62]": 350, "[35, 39, 42, 45]": 351, "[33, 36, 43, 47]": 352, "[36, 38, 41]": 353, "[34, 37, 43]": 354, "[36, 41, 44]": 355, "[43, 48, 53]": 356, "[32, 35, 38, 40]": 357, "[43, 45, 48, 51]": 358, "[33, 39]": 359, "[33, 36, 38, 41]": 360, "[49, 52, 55, 57]": 361, "[34, 39, 43]": 362, "[37, 41, 44, 48]": 363, "[46, 48, 52]": 364, "[42, 45, 49, 52]": 365, "[48, 52, 53, 57]": 366, "[50, 57, 59]": 367, "[50, 52, 55, 59]": 368, "[51, 55, 60]": 369, "[48, 51, 56]": 370, "[49, 52, 56]": 371, "[55, 60, 64]": 372, "[47, 50, 56]": 373, "[41, 46, 49]": 374, "[39, 43, 46, 49]": 375, "[34, 40]": 376, "[51, 55, 58, 62]": 377, "[44, 46, 49, 52]": 378, "[37, 41, 44, 47]": 379, "[52, 57, 61]": 380, "[52, 55, 62, 65, 69]": 381, "[38, 41, 48]": 382, "[36, 43, 45]": 383, "[55, 58, 62]": 384, "[46, 50, 57, 60]": 385, "[39, 42, 46, 49]": 386, "[34, 38, 41, 43]": 387, "[33, 40, 42]": 388, "[38, 41, 45, 47]": 389, "[36, 41]": 390, "[50, 53, 57, 58]": 391, "[45, 46, 50, 53]": 392, "[33, 37, 40, 44]": 393, "[39, 44, 48]": 394, "[39, 44, 46]": 395, "[39, 42, 46]": 396, "[39, 41, 46]": 397, "[42, 47, 49]": 398, "[42, 44, 49]": 399, "[57, 62, 64]": 400, "[47, 50, 57, 60, 64]": 401, "[35, 37, 40, 44]": 402, "[44, 49, 52]": 403, "[47, 51, 58, 61]": 404, "[36, 40, 46, 50, 53]": 405, "[40, 46, 50]": 406, "[35, 39, 44]": 407, "[34, 39, 41]": 408, "[36, 40, 41, 45]": 409, "[37, 43, 47]": 410, "[36, 43, 46]": 411, "[52, 55, 58, 60]": 412, "[36, 40, 42, 45]": 413, "[35, 38, 41]": 414, "[36, 38, 41, 44]": 415, "[42, 48, 52]": 416, "[44, 49, 51]": 417, "[50, 56, 60]": 418, "[40, 45, 50]": 419, "[43, 44, 48, 51]": 420, "[55, 60, 62]": 421, "[53, 60, 63]": 422, "[46, 51, 56]": 423, "[46, 51, 55]": 424, "[54, 58, 61]": 425, "[50, 54, 59]": 426, "[50, 55, 60]": 427, "[50, 51, 55, 58]": 428, "[48, 52, 54, 57]": 429, "[35, 40, 42]": 430, "[44, 50, 54]": 431, "[53, 56, 62]": 432, "[44, 49, 53]": 433, "[43, 46, 49, 53]": 434, "[51, 54, 60]": 435, "[38, 42, 48, 52, 55]": 436, "[43, 46, 50, 51]": 437, "[37, 41, 43, 46]": 438, "[32, 35, 39]": 439, "[39, 42, 48]": 440, "[34, 36, 40, 43]": 441, "[48, 55, 57]": 442, "[40, 43, 50, 54, 57]": 443, "[41, 44, 51, 55]": 444, "[37, 40, 47, 51]": 445, "[51, 53, 56, 60]": 446, "[38, 42, 49, 52]": 447, "[48, 51, 58, 62, 65]": 448, "[48, 51, 55, 57]": 449, "[51, 54, 59]": 450, "[45, 48, 51, 53]": 451, "[49, 56, 59]": 452, "[45, 49, 54]": 453, "[39, 42, 46, 48]": 454, "[37, 40, 43, 47]": 455, "[45, 49, 55, 59, 62]": 456, "[46, 49, 53, 56]": 457, "[36, 39, 46, 50]": 458, "[37, 41, 48, 51]": 459, "[43, 46, 53, 57, 60]": 460, "[51, 55, 58, 60]": 461, "[35, 38, 40, 44]": 462, "[46, 51, 53]": 463, "[51, 54, 57]": 464, "[52, 55, 62, 66]": 465, "[51, 55, 62, 65]": 466, "[48, 51, 53, 56]": 467, "[47, 51, 53, 57]": 468, "[51, 53, 57, 59]": 469, "[45, 49, 51, 53]": 470, "[53, 58, 60]": 471, "[37, 41, 46]": 472, "[39, 41, 45, 48]": 473, "[41, 44, 47, 51]": 474, "[47, 54, 57]": 475, "[46, 53, 55]": 476, "[50, 52, 55]": 477, "[39, 41, 44, 48]": 478, "[50, 53, 60, 64, 67]": 479, "[46, 50, 52, 55]": 480, "[37, 40, 43, 45]": 481, "[37, 44, 47]": 482, "[54, 59, 62]": 483, "[46, 53, 56]": 484, "[40, 42, 45]": 485, "[41, 48, 51]": 486, "[34, 38, 40, 43]": 487, "[49, 53, 56, 59]": 488, "[44, 45, 49, 52]": 489, "[45, 49, 56, 59]": 490, "[46, 48, 51]": 491, "[35, 42, 45]": 492, "[38, 42, 43, 47]": 493, "[48, 49, 53, 56]": 494, "[39, 43, 44, 48]": 495, "[45, 52, 54]": 496, "[38, 42, 45, 47]": 497, "[47, 49, 53, 56]": 498, "[46, 49, 56, 59]": 499, "[36, 47, 50, 53]": 500, "[44, 48, 52]": 501, "[33, 35, 38]": 502, "[40, 44, 50, 54, 57]": 503, "[42, 44, 47, 51]": 504, "[48, 51, 57]": 505, "[43, 47, 53]": 506, "[32, 36, 43, 46]": 507, "[36, 43, 47]": 508, "[33, 35, 39, 42]": 509, "[42, 47, 52]": 510, "[52, 59]": 511, "[49, 53, 55, 58]": 512, "[41, 45, 51, 55, 58]": 513, "[43, 46, 48, 51]": 514, "[52, 53, 57, 60]": 515, "[46, 49, 53, 55]": 516, "[41, 48, 50]": 517, "[46, 49, 54]": 518, "[48, 54, 58]": 519, "[46, 50, 56, 60, 63]": 520, "[47, 50, 57, 60]": 521, "[49, 52, 56, 59]": 522, "[40, 44, 45, 49]": 523, "[38, 41, 45, 46]": 524, "[51, 54, 56, 60]": 525, "[39, 46, 50]": 526, "[47, 51, 54, 58]": 527, "[41, 45, 46, 50]": 528, "[31, 35, 41]": 529, "[54, 60, 64]": 530, "[48, 51, 58, 62]": 531, "[45, 50]": 532, "[52, 58, 62]": 533, "[52, 54, 57, 60]": 534, "[37, 41, 45]": 535, "[31, 35, 36, 40]": 536, "[51, 54, 58]": 537, "[39, 44, 47]": 538, "[49, 53, 58]": 539, "[40, 43, 47, 49]": 540, "[47, 49, 52, 55]": 541, "[36, 39, 41, 45]": 542, "[41, 44, 51, 55, 58]": 543, "[35, 37, 42]": 544, "[40, 43, 50, 53, 57]": 545, "[48, 53, 58]": 546, "[49, 54, 58]": 547, "[42, 45, 47, 50]": 548, "[48, 52, 58, 62, 65]": 549, "[34, 37, 41]": 550, "[35, 41, 45]": 551, "[39, 40, 44, 47]": 552, "[47, 49, 54]": 553, "[51, 53, 58]": 554, "[47, 49, 52]": 555, "[53, 56, 63, 67, 70]": 556, "[49, 55, 59]": 557, "[36, 39, 44]": 558, "[46, 49, 52, 54]": 559, "[33, 40, 44]": 560, "[42, 49, 52]": 561, "[53, 55, 59]": 562, "[42, 49, 53]": 563, "[48, 52, 54]": 564, "[53, 60, 64]": 565, "[52, 55, 59, 60]": 566, "[50, 54, 57, 59]": 567, "[38, 43, 48]": 568, "[36, 41, 46]": 569, "[44, 47, 51, 53]": 570, "[43, 46, 49, 51]": 571, "[47, 51, 54, 56]": 572, "[47, 50, 57, 61, 64]": 573, "[42, 45, 52, 56]": 574, "[33, 35, 38, 42]": 575, "[35, 39, 45, 49, 52]": 576, "[32, 37, 39]": 577, "[32, 35, 39, 42]": 578, "[51, 55, 56, 60]": 579, "[44, 48, 49, 53]": 580, "[53, 58, 62]": 581, "[51, 56, 61]": 582, "[42, 44, 48, 51]": 583, "[44, 46, 49, 53]": 584, "[48, 51, 55, 56]": 585, "[42, 45, 48]": 586, "[42, 46, 48, 51]": 587, "[35, 38, 45, 48]": 588, "[49, 52, 58]": 589, "[40, 44, 50]": 590, "[40, 44, 48]": 591, "[43, 47, 51]": 592, "[49, 51, 55, 58]": 593, "[53, 56, 63, 67]": 594, "[44, 46, 49]": 595, "[39, 43, 47]": 596, "[43, 46, 53, 56, 60]": 597, "[49, 50, 54, 57]": 598, "[52, 56, 59, 63]": 599, "[62, 65, 69]": 600, "[40, 42, 45, 49]": 601, "[49, 54, 56]": 602, "[46, 52, 56]": 603, "[38, 44, 48]": 604, "[32, 34, 38, 41]": 605, "[38, 39, 43, 46]": 606, "[40, 43, 50, 53]": 607, "[42, 45, 49, 51]": 608, "[42, 44, 47, 50]": 609, "[44, 48, 50]": 610, "[48, 51, 54, 58]": 611, "[40, 43, 50, 54]": 612, "[41, 45, 51]": 613, "[49, 54, 57]": 614, "[44, 47, 50]": 615, "[46, 50, 51, 55]": 616, "[37, 40, 46]": 617, "[46, 49, 55]": 618, "[31, 35, 41, 45, 48]": 619, "[44, 46, 51]": 620, "[36, 39, 45]": 621, "[38, 42, 44, 47]": 622, "[34, 38, 42]": 623, "[41, 44, 46, 50]": 624, "[34, 37, 42]": 625, "[48, 51, 53, 57]": 626, "[47, 50, 57, 61]": 627, "[42, 45, 52, 55]": 628, "[52, 55, 58, 62]": 629, "[46, 51, 54]": 630, "[43, 46, 53, 56]": 631, "[36, 39, 42, 46]": 632, "[51, 58, 60]": 633, "[51, 56, 59]": 634, "[45, 56, 59, 62]": 635, "[33, 37, 44, 47]": 636, "[46, 48, 51, 54]": 637, "[32, 36, 40]": 638, "[39, 42, 45, 49]": 639, "[35, 38, 45, 48, 52]": 640, "[36, 40, 46]": 641, "[40, 48, 50]": 642, "[35, 39, 41, 44]": 643, "[34, 41, 44]": 644, "[37, 39, 43, 46]": 645, "[44, 48, 54, 58, 61]": 646, "[45, 49, 51, 54]": 647, "[40, 44, 47, 49]": 648, "[46, 50, 52]": 649, "[32, 35, 38, 42]": 650, "[35, 37, 40, 43]": 651, "[33, 34, 38, 41]": 652, "[39, 42, 44, 48]": 653, "[45, 48, 55, 58]": 654, "[33, 36, 39, 41]": 655, "[38, 41, 48, 51, 55]": 656, "[49, 52, 59, 62, 66]": 657, "[49, 52, 55, 59]": 658, "[31, 33, 37, 40]": 659, "[45, 48, 55, 58, 62]": 660, "[45, 49, 53, 55]": 661, "[43, 44, 51]": 662, "[36, 39, 41, 44]": 663, "[40, 47, 51]": 664, "[39, 46, 49]": 665, "[44, 47, 53]": 666, "[44, 47, 54]": 667, "[55, 61, 65]": 668, "[42, 43, 47, 50]": 669, "[47, 48, 52]": 670, "[36, 40, 44]": 671, "[31, 33, 38]": 672, "[31, 34, 39]": 673, "[38, 40, 43, 46]": 674, "[37, 42, 44]": 675, "[32, 37, 41]": 676, "[37, 39, 44]": 677, "[51, 55, 57, 60]": 678, "[37, 41, 44, 46]": 679, "[47, 50, 54, 55]": 680, "[33, 44, 47, 50]": 681, "[34, 36, 39, 43]": 682, "[34, 38, 44, 48, 51]": 683, "[56, 62, 66]": 684, "[49, 51, 56]": 685, "[51, 53, 59]": 686, "[51, 53, 56, 59]": 687, "[52, 54, 58, 61]": 688, "[55, 60, 63]": 689, "[52, 57, 62]": 690, "[34, 37, 40, 42]": 691, "[52, 56, 60]": 692, "[52, 55, 62, 66, 69]": 693, "[38, 42, 48]": 694, "[38, 41, 43, 46]": 695, "[32, 36, 39, 42]": 696, "[31, 36, 41]": 697, "[46, 49, 51, 54]": 698, "[53, 55, 58, 62]": 699, "[51, 58, 62]": 700, "[50, 52, 55, 58]": 701, "[44, 51, 54]": 702, "[42, 46, 49, 51]": 703, "[37, 41, 47]": 704, "[37, 40, 47, 51, 54]": 705, "[42, 45, 52, 55, 59]": 706, "[46, 49, 56, 60, 63]": 707, "[33, 38, 43]": 708, "[43, 50, 54]": 709, "[45, 49, 53]": 710, "[45, 47, 51]": 711, "[47, 51, 55]": 712, "[36, 39, 43, 44]": 713, "[37, 39, 42, 45]": 714, "[46, 49, 52, 56]": 715, "[47, 51, 55, 57]": 716, "[37, 40, 44, 46]": 717, "[51, 55, 61, 65, 68]": 718, "[52, 56, 62, 66, 69]": 719, "[48, 51, 58, 61, 65]": 720, "[42, 45, 52, 56, 59]": 721, "[49, 52, 59, 63]": 722, "[49, 53, 57]": 723, "[34, 38, 39, 43]": 724, "[32, 36, 37, 41]": 725, "[35, 38, 42, 44]": 726, "[35, 37, 40]": 727, "[47, 51, 57, 61, 64]": 728, "[32, 34, 39]": 729, "[60, 63, 67]": 730, "[54, 59, 63]": 731, "[50, 53, 56]": 732, "[57, 63, 67]": 733, "[44, 46, 50]": 734, "[38, 41, 48, 51]": 735, "[40, 44, 51, 54]": 736, "[64, 67, 71]": 737, "[50, 53, 55, 58]": 738, "[41, 44, 48, 49]": 739, "[47, 53, 55]": 740, "[43, 49, 53]": 741, "[52, 56, 61]": 742, "[57, 60, 64]": 743, "[42, 46, 50]": 744, "[50, 54, 58]": 745, "[50, 54, 56]": 746, "[52, 55, 61]": 747, "[45, 49, 50, 54]": 748, "[34, 37, 40]": 749, "[40, 51, 54, 57]": 750, "[49, 52, 54, 58]": 751, "[33, 36, 43, 46, 50]": 752, "[47, 54]": 753, "[35, 37, 41, 44]": 754, "[46]": 755, "[52]": 756, "[45, 46]": 757, "[54]": 758, "[45]": 759, "[44]": 760, "[47]": 761, "[50, 51]": 762, "[49]": 763, "[47, 48]": 764, "[48, 49]": 765, "[49, 50]": 766, "[48]": 767, "[68]": 768, "[61, 62]": 769, "[50]": 770, "[53]": 771, "[64]": 772, "[56]": 773, "[51]": 774, "[62]": 775, "[60, 61]": 776, "[60]": 777, "[55]": 778, "[57, 58]": 779, "[58]": 780, "[44, 47]": 781, "[54, 55]": 782, "[57]": 783, "[38]": 784, "[34, 41, 43]": 785, "[31, 34, 39, 43]": 786, "[34]": 787, "[17, 29, 34]": 788, "[34, 39]": 789, "[34, 36, 39, 46]": 790, "[34, 36]": 791, "[17]": 792, "[17, 22, 29, 34]": 793, "[22, 29]": 794, "[31, 41, 43]": 795, "[51, 52]": 796, "[46, 47]": 797, "[43]": 798, "[36]": 799, "[24, 36]": 800, "[24]": 801, "[29]": 802, "[31]": 803, "[24, 31]": 804, "[28, 29]": 805, "[33]": 806, "[35]": 807, "[24, 28, 40]": 808, "[35, 45]": 809, "[24, 28]": 810, "[31, 35]": 811, "[26, 29, 33, 35]": 812, "[26]": 813, "[31, 47]": 814, "[24, 26]": 815, "[30, 35, 42]": 816, "[53, 54, 57]": 817, "[56, 57]": 818, "[30]": 819, "[41]": 820, "[46, 50]": 821, "[52, 54]": 822, "[44, 46]": 823, "[47, 57]": 824, "[42]": 825, "[16, 57]": 826, "[9, 48, 54, 57]": 827, "[23, 47, 50, 52]": 828, "[23, 47, 51, 54]": 829, "[23, 47]": 830, "[28, 53]": 831, "[54, 58]": 832, "[14, 16, 19, 52]": 833, "[14, 26, 30, 50, 54, 58]": 834, "[14, 52]": 835, "[28, 49, 52, 58]": 836, "[19]": 837, "[28]": 838, "[14]": 839, "[9, 21]": 840, "[28, 55]": 841, "[45, 57]": 842, "[21, 33]": 843, "[37, 45, 49]": 844, "[37]": 845, "[42, 45, 47]": 846, "[27, 39, 41, 46]": 847, "[28, 35, 38]": 848, "[35, 47]": 849, "[33, 35, 47]": 850, "[9, 10]": 851, "[46, 49]": 852, "[35, 38]": 853, "[38, 45]": 854, "[36, 38]": 855, "[33, 36, 38, 41, 45]": 856, "[36, 43, 48]": 857, "[38, 48]": 858, "[38, 41]": 859, "[45, 48]": 860, "[41, 45]": 861, "[40, 50]": 862, "[42, 45]": 863, "[34, 41]": 864, "[16]": 865, "[40]": 866, "[21]": 867, "[9, 43]": 868, "[24, 31, 33]": 869, "[31, 33]": 870, "[69]": 871, "[33, 45, 48, 52]": 872, "[36, 45]": 873, "[39]": 874, "[39, 40]": 875, "[40, 48, 49, 52]": 876, "[59]": 877, "[63]": 878, "[61]": 879, "[44, 45]": 880, "[59, 60]": 881, "[44, 48]": 882, "[53, 54]": 883, "[14, 26]": 884, "[22]": 885, "[23, 35]": 886, "[23]": 887, "[21, 23, 35]": 888, "[24, 25]": 889, "[36, 40]": 890, "[20]": 891, "[24, 52]": 892, "[36, 48]": 893, "[22, 34]": 894, "[27, 32, 34, 39, 44]": 895, "[34, 42, 44]": 896, "[34, 42]": 897, "[34, 44]": 898, "[34, 37, 39]": 899, "[34, 37]": 900, "[32, 36, 37, 44, 48, 54]": 901, "[36, 48, 52, 54]": 902, "[29, 32, 34]": 903, "[36, 44]": 904, "[66]": 905, "[52, 53]": 906, "[47, 49]": 907, "[62, 64]": 908, "[63, 64]": 909, "[49, 51]": 910, "[14, 26, 35, 38]": 911, "[9]": 912, "[38, 47, 50]": 913, "[40, 52]": 914, "[7, 19, 26, 30, 31, 35, 43]": 915, "[7, 19, 35, 43]": 916, "[35, 38, 40, 43, 50]": 917, "[26, 31, 35, 38, 40, 43, 50]": 918, "[19, 26, 31, 35, 38, 40, 43]": 919, "[26, 35, 38, 40, 43, 50]": 920, "[18]": 921, "[18, 26, 30, 33, 38]": 922, "[26, 30, 33, 37, 38, 42]": 923, "[26, 30, 33, 37, 38]": 924, "[26, 28, 30, 33, 37, 38, 40]": 925, "[9, 21, 28, 33, 37]": 926, "[33, 37, 40, 42]": 927, "[28, 33, 37, 40, 42]": 928, "[28, 30, 33, 37, 40, 42, 43]": 929, "[11, 23, 30, 33, 35, 38, 42]": 930, "[23, 35, 38, 40]": 931, "[9, 21, 28, 37]": 932, "[9, 21, 28, 42]": 933, "[7, 28, 31, 35, 37, 40]": 934, "[7, 26, 31, 35, 38]": 935, "[26, 31, 35]": 936, "[26, 38, 43]": 937, "[26, 38, 40, 42]": 938, "[26, 31, 35, 38, 40, 43]": 939, "[11, 35, 38, 40, 43]": 940, "[11, 35, 38, 40]": 941, "[30, 40]": 942, "[28, 30, 38, 40]": 943, "[28, 38]": 944, "[9, 21, 28, 33, 37, 40, 42]": 945, "[9, 21, 28, 33, 37, 40]": 946, "[7, 19, 26, 31, 35]": 947, "[7, 19, 26, 31, 35, 38]": 948, "[19, 26, 31, 33, 38, 43]": 949, "[31, 35, 38, 40, 43]": 950, "[11, 23, 31, 35, 38, 40, 43]": 951, "[11, 23, 30, 31, 35, 38, 42]": 952, "[28, 30, 38, 40, 42]": 953, "[30, 38, 40, 42]": 954, "[9, 21, 30, 33, 37, 40, 42]": 955, "[33, 37, 40, 42, 45]": 956, "[21, 26, 31, 33, 38, 42, 45]": 957, "[26, 33, 38, 42]": 958, "[33, 38]": 959, "[25, 32]": 960, "[24, 29, 32, 36]": 961, "[24, 29, 32]": 962, "[32, 34]": 963, "[27, 32, 36, 39, 44]": 964, "[20, 24, 27, 32, 36, 39, 44]": 965, "[24, 27, 29, 32, 36, 39, 41]": 966, "[25, 29, 32, 37]": 967, "[29, 32, 36]": 968, "[24, 29, 33]": 969, "[20, 24, 32, 34, 36]": 970, "[43, 44]": 971, "[40, 42, 44]": 972, "[37, 38]": 973, "[39, 41]": 974, "[39, 42, 51]": 975, "[45, 52]": 976, "[50, 53]": 977, "[58, 59]": 978, "[48, 50]": 979, "[56, 58]": 980, "[48, 58]": 981, "[6, 18]": 982, "[32, 36]": 983, "[32, 34, 36]": 984, "[22, 37]": 985, "[37, 41]": 986, "[32, 37, 41, 44]": 987, "[32, 36, 39, 41, 44]": 988, "[34, 37, 44, 46]": 989, "[32, 37]": 990, "[6, 13, 18, 25, 29, 30, 32]": 991, "[13, 25, 29, 32, 37, 41]": 992, "[13, 25, 29, 32, 37, 39, 41]": 993, "[27, 29, 32, 39, 41]": 994, "[13, 25, 29, 32, 34, 37, 41]": 995, "[13, 25, 27, 29, 37, 39, 41]": 996, "[6, 18, 25, 30, 32, 37, 41]": 997, "[6, 18, 25, 30, 32, 37]": 998, "[6, 18, 30, 32, 37]": 999, "[37, 39]": 1000, "[13, 37, 39]": 1001, "[13, 37]": 1002, "[13, 37, 41]": 1003, "[13, 37, 41, 44]": 1004, "[13, 37, 39, 41]": 1005, "[13, 37, 41, 44, 49]": 1006, "[37, 39, 41]": 1007, "[37, 44]": 1008, "[13, 25, 37, 39, 44]": 1009, "[13, 25, 37, 40, 44]": 1010, "[13, 25, 37, 41, 44]": 1011, "[13, 20, 25, 37, 41, 44]": 1012, "[27, 42, 44, 48]": 1013, "[25, 34, 37]": 1014, "[27]": 1015, "[30, 47]": 1016, "[27, 28]": 1017, "[22, 27, 34]": 1018, "[27, 30, 47]": 1019, "[28, 40]": 1020, "[28, 30, 42, 45, 49]": 1021, "[25, 27]": 1022, "[48, 51]": 1023, "[45, 49, 51]": 1024, "[28, 51]": 1025, "[33, 45]": 1026, "[29, 38, 41]": 1027, "[30, 34, 37, 42]": 1028, "[30, 34, 37, 40, 42]": 1029, "[10, 18, 22, 34]": 1030, "[10, 18, 22, 34, 37, 42]": 1031, "[34, 42, 46]": 1032, "[34, 37, 42, 46]": 1033, "[35, 42]": 1034, "[35, 39]": 1035, "[22, 26]": 1036, "[19, 23, 26]": 1037, "[24, 35]": 1038, "[19, 24, 26, 36]": 1039, "[27, 36]": 1040, "[36, 39]": 1041, "[27, 43]": 1042, "[19, 26]": 1043, "[27, 31, 43]": 1044, "[20, 22]": 1045, "[24, 41]": 1046, "[27, 39, 43]": 1047, "[40, 41]": 1048, "[36, 43]": 1049, "[41, 43]": 1050, "[53, 65]": 1051, "[52, 53, 55, 59, 64, 65]": 1052, "[40, 48, 55, 60, 64]": 1053, "[22, 29, 34]": 1054, "[29, 36, 41, 45]": 1055, "[29, 36, 45]": 1056, "[29, 36]": 1057, "[24, 31, 36]": 1058, "[24, 48]": 1059, "[26, 33, 41, 45]": 1060, "[22, 29, 34, 38]": 1061, "[16, 28, 45, 48, 52]": 1062, "[16, 28, 36, 45, 48, 52]": 1063, "[28, 40, 45, 47]": 1064, "[38, 40, 50]": 1065, "[10, 14, 26, 27, 31]": 1066, "[10, 14, 22, 34, 38, 46]": 1067, "[38, 50]": 1068, "[34, 41, 46]": 1069, "[33, 36, 41, 45, 48]": 1070, "[10, 22]": 1071, "[34, 38]": 1072, "[17, 33, 36]": 1073, "[34, 43]": 1074, "[9, 17, 21, 33, 36, 39, 41]": 1075, "[5, 36, 39, 41]": 1076, "[5, 33, 36]": 1077, "[5, 33, 36, 41]": 1078, "[34, 46]": 1079, "[39, 43, 45]": 1080, "[15, 34, 39, 41]": 1081, "[34, 36, 38, 46, 48]": 1082, "[33, 36, 41, 45]": 1083, "[9, 17, 33, 36, 41, 45]": 1084, "[34, 38, 41, 43, 46]": 1085, "[32, 42]": 1086, "[39, 42]": 1087, "[32]": 1088, "[32, 44]": 1089, "[38, 40]": 1090, "[11, 23]": 1091, "[30, 42]": 1092, "[42, 50]": 1093, "[40, 42]": 1094, "[21, 40]": 1095, "[57, 59]": 1096, "[31, 43]": 1097, "[31, 38, 43]": 1098, "[31, 35, 43]": 1099, "[41, 44]": 1100, "[8, 20]": 1101, "[15, 25]": 1102, "[48, 52]": 1103, "[12, 24]": 1104, "[19, 31]": 1105, "[9, 55]": 1106, "[21, 25, 30]": 1107, "[33, 35]": 1108, "[37, 40]": 1109, "[32, 33]": 1110, "[25, 35, 37]": 1111, "[35, 40]": 1112, "[26, 28, 30, 42]": 1113, "[30, 37]": 1114, "[25]": 1115, "[23, 25]": 1116, "[23, 32]": 1117, "[37, 49]": 1118, "[37, 42]": 1119, "[37, 47]": 1120, "[35, 37]": 1121, "[2, 4, 14, 16]": 1122, "[14, 16]": 1123, "[40, 49]": 1124, "[18, 21]": 1125, "[18, 33, 35]": 1126, "[40, 45]": 1127, "[32, 35]": 1128, "[43, 55]": 1129, "[13]": 1130, "[10]": 1131, "[10, 22, 46, 49]": 1132, "[10, 46, 49]": 1133, "[37, 46]": 1134, "[10, 13, 22]": 1135, "[39, 46]": 1136, "[10, 17]": 1137, "[34, 37, 46, 49]": 1138, "[49, 56]": 1139, "[5]": 1140, "[46, 53]": 1141, "[41, 46, 50, 53]": 1142, "[33, 40]": 1143, "[38, 43, 45, 50]": 1144, "[41, 42, 45]": 1145, "[33, 41, 45, 50]": 1146, "[9, 21, 33, 45]": 1147, "[16, 28]": 1148, "[37, 45]": 1149, "[42, 44]": 1150, "[11, 35, 42, 44, 47, 51]": 1151, "[11, 35, 39, 42]": 1152, "[35, 42, 44]": 1153, "[28, 32, 44]": 1154, "[44, 54]": 1155, "[35, 40, 44, 47, 52]": 1156, "[42, 49]": 1157, "[30, 39, 42, 47]": 1158, "[16, 40, 49, 52]": 1159, "[13, 16, 35, 40, 44, 47, 49]": 1160, "[42, 44, 49, 54]": 1161, "[32, 35, 37, 40, 44]": 1162, "[37, 39, 42]": 1163, "[20, 32, 35, 39, 42]": 1164, "[31, 38]": 1165, "[67]": 1166, "[65]": 1167, "[9, 21, 33]": 1168, "[70]": 1169, "[34, 46, 50]": 1170, "[36, 39, 48, 51]": 1171, "[19, 47]": 1172, "[9, 21, 50, 55, 57, 62, 67]": 1173, "[52, 54, 62, 64, 66]": 1174, "[25, 37]": 1175, "[30, 34, 37]": 1176, "[18, 37]": 1177, "[25, 34, 37, 42]": 1178, "[6, 18, 30]": 1179, "[17, 24, 41, 48]": 1180, "[34, 38, 46]": 1181, "[21, 24, 28, 33, 40]": 1182, "[26, 35]": 1183, "[29, 33]": 1184, "[29, 33, 41]": 1185, "[29, 33, 36, 38, 41]": 1186, "[33, 34, 37]": 1187, "[7, 19]": 1188, "[12, 24, 28, 31, 36, 40]": 1189, "[24, 28, 31, 36, 40]": 1190, "[7, 19, 31, 35, 38, 43]": 1191, "[7, 19, 28, 31, 36, 40, 43]": 1192, "[33, 43]": 1193, "[19, 35, 38, 43]": 1194, "[7, 19, 36, 40, 43]": 1195, "[35, 43]": 1196, "[29, 41]": 1197, "[7, 19, 31, 43]": 1198, "[12, 24, 28, 31]": 1199, "[9, 40]": 1200, "[12]": 1201, "[7]": 1202, "[7, 19, 31]": 1203, "[7, 9, 33, 36, 40, 43]": 1204, "[29, 32, 37, 41]": 1205, "[10, 25]": 1206, "[10, 22, 27, 29, 32, 34, 39]": 1207, "[10, 34, 37, 42, 46]": 1208, "[34, 44, 46]": 1209, "[27, 34, 39, 41, 44, 46]": 1210, "[27, 34, 39, 44, 46]": 1211, "[35, 36]": 1212, "[35, 44]": 1213, "[37, 39, 45]": 1214, "[43, 50]": 1215, "[29, 33, 36]": 1216, "[33, 36]": 1217, "[55, 56]": 1218, "[31, 36]": 1219, "[15, 27, 39]": 1220, "[15, 39]": 1221, "[38, 39]": 1222, "[45, 47]": 1223, "[31, 34, 43]": 1224, "[28, 35]": 1225, "[24, 25, 28]": 1226, "[64, 65]": 1227, "[23, 35, 39]": 1228, "[51, 53]": 1229, "[40, 44]": 1230, "[16, 28, 40, 47, 52]": 1231, "[7, 10, 19, 22, 34]": 1232, "[11]": 1233, "[13, 34]": 1234, "[43, 45]": 1235, "[26, 30, 34, 35]": 1236, "[19, 30, 31, 34]": 1237, "[14, 26, 33]": 1238, "[14, 26, 33, 42]": 1239, "[14, 26, 33, 38, 41]": 1240, "[14, 26, 33, 38, 42]": 1241, "[14, 21, 25, 26, 28, 33, 38]": 1242, "[21, 25, 28, 33]": 1243, "[21, 25, 28, 30, 33]": 1244, "[21, 25, 28, 30, 33, 37, 40]": 1245, "[25, 30, 37, 42, 44, 49]": 1246, "[25, 29, 37, 41, 44, 47, 49]": 1247, "[23, 28, 31, 35, 40]": 1248, "[23, 28, 31, 35, 40, 47]": 1249, "[23, 28, 30, 35, 40, 42, 47]": 1250, "[23, 28, 31, 35, 38, 40, 41]": 1251, "[19, 40, 43, 45]": 1252, "[19, 40, 43]": 1253, "[19, 35, 38, 40, 43]": 1254, "[19, 31, 35, 38, 40, 43]": 1255, "[19, 31, 35, 38, 43]": 1256, "[28, 32, 35, 40, 44, 47]": 1257, "[28, 32, 35, 56]": 1258, "[33, 37, 40, 49, 52]": 1259, "[32, 37, 40, 44, 49, 52]": 1260, "[33, 37, 39, 42, 45]": 1261, "[30, 35, 39]": 1262, "[28, 32, 37, 44]": 1263, "[11, 23, 30, 35, 39]": 1264, "[21, 28, 33, 35, 45]": 1265, "[21, 28]": 1266, "[18, 28, 32, 35, 42, 44]": 1267, "[18, 40, 42, 44]": 1268, "[28, 35, 40, 44]": 1269, "[28, 35, 44]": 1270, "[21, 35]": 1271, "[33, 35, 45, 47, 52, 57]": 1272, "[33, 35, 45]": 1273, "[16, 28, 35, 40]": 1274, "[30, 32, 37, 44]": 1275, "[24, 29, 36]": 1276, "[24, 33, 36]": 1277, "[31, 34, 36]": 1278, "[26, 34, 36]": 1279, "[22, 24, 26, 34, 36]": 1280, "[24, 29, 31]": 1281, "[29, 31, 35]": 1282, "[17, 19, 29, 31, 35]": 1283, "[19, 24, 29, 31, 36]": 1284, "[19, 24, 31, 36]": 1285, "[24, 29]": 1286, "[24, 28, 36]": 1287, "[21, 26, 31, 43, 45]": 1288, "[34, 42, 44, 46, 47]": 1289, "[34, 39, 46]": 1290, "[34, 37, 39, 42, 46]": 1291, "[32, 34, 37, 44, 46]": 1292, "[32, 34, 37, 41]": 1293, "[42, 43]": 1294, "[40, 43, 48, 52]": 1295, "[14, 21, 33, 38]": 1296, "[14, 21, 33, 41, 45, 48, 50]": 1297, "[14, 21, 33, 38, 41, 45, 50]": 1298, "[14, 21, 33, 38, 41]": 1299, "[14, 29, 33, 38, 41]": 1300, "[29, 33, 38, 41]": 1301, "[47, 50]": 1302, "[50, 55]": 1303, "[34, 52]": 1304, "[33, 42]": 1305, "[22, 34, 46]": 1306, "[40, 43]": 1307, "[21, 26, 30, 33, 38]": 1308, "[31, 34, 38, 43]": 1309, "[33, 34, 38]": 1310, "[26, 33, 38]": 1311, "[30, 33, 38]": 1312, "[21, 30, 33, 38]": 1313, "[21, 33, 34, 38]": 1314, "[34, 38, 40]": 1315, "[65, 67]": 1316, "[49, 52]": 1317, "[46, 48]": 1318, "[40, 43, 55]": 1319, "[35, 43, 47]": 1320, "[49, 58]": 1321, "[11, 23, 28, 30, 40, 42]": 1322, "[13, 25]": 1323, "[25, 30, 32, 37, 42, 44]": 1324, "[32, 37, 44]": 1325, "[13, 23, 25, 37]": 1326, "[16, 21, 37]": 1327, "[21, 37]": 1328, "[45, 55]": 1329, "[38, 42]": 1330, "[2, 9, 14, 42]": 1331, "[2, 14]": 1332, "[27, 36, 39, 43]": 1333, "[22, 27, 36, 39, 46]": 1334, "[15, 22, 27, 31, 39, 46]": 1335, "[24, 29, 36, 41, 48]": 1336, "[24, 32]": 1337, "[31, 39]": 1338, "[22, 27, 31, 34]": 1339, "[22, 31]": 1340, "[26, 34]": 1341, "[27, 36, 39]": 1342, "[24, 27, 36, 39, 41]": 1343, "[20, 24, 27, 29, 32, 36, 41]": 1344, "[15, 22, 27, 39, 41, 46]": 1345, "[15, 22, 31]": 1346, "[22, 27, 31]": 1347, "[24, 29, 41]": 1348, "[15, 22, 29, 32, 39]": 1349, "[15, 22, 24, 31, 39, 43]": 1350, "[15, 22, 24, 31, 43]": 1351, "[22, 24, 29, 31, 43]": 1352, "[22, 38]": 1353, "[23, 29]": 1354, "[24, 27, 36]": 1355, "[24, 27, 31, 36]": 1356, "[22, 24, 27, 31, 36]": 1357, "[24, 27, 31]": 1358, "[24, 27, 31, 36, 44]": 1359, "[19, 24, 27, 31]": 1360, "[22, 24, 27, 31, 32, 34, 44]": 1361, "[3, 24, 27, 31]": 1362, "[27, 31]": 1363, "[20, 24, 27, 31, 36]": 1364, "[29, 31, 36]": 1365, "[27, 31, 36]": 1366, "[27, 31, 34, 46]": 1367, "[26, 31, 36]": 1368, "[32, 37, 42]": 1369, "[22, 30, 34, 37]": 1370, "[12, 24, 36, 40, 48]": 1371, "[7, 36, 38, 43]": 1372, "[26, 31, 35, 38]": 1373, "[33, 36, 45]": 1374, "[7, 19, 35, 38, 43]": 1375, "[38, 43]": 1376, "[29, 33, 36, 41, 43]": 1377, "[26, 36]": 1378, "[39, 43]": 1379, "[10, 41]": 1380, "[31, 41]": 1381, "[26, 30, 33, 38, 42]": 1382, "[14, 47]": 1383, "[39, 51]": 1384, "[28, 33]": 1385, "[34, 36, 38]": 1386, "[29, 33, 36, 41]": 1387, "[31, 34, 38, 46]": 1388, "[31, 34, 38, 41, 43, 46, 48]": 1389, "[29, 34, 38, 41]": 1390, "[10, 31, 34, 41, 43]": 1391, "[31, 34, 38, 39, 43]": 1392, "[36, 39, 41, 45, 48]": 1393, "[4, 28]": 1394, "[4, 16, 28, 35]": 1395, "[9, 14, 21]": 1396, "[2, 9, 14, 33, 45]": 1397, "[2]": 1398, "[2, 14, 26]": 1399, "[2, 26]": 1400, "[9, 21, 28, 33]": 1401, "[9, 21, 28, 31, 33]": 1402, "[21, 28, 33]": 1403, "[28, 33, 37, 40]": 1404, "[16, 22]": 1405, "[59, 61]": 1406, "[53, 56]": 1407, "[15]": 1408, "[1, 10]": 1409, "[34, 37, 46]": 1410, "[23, 33]": 1411, "[33, 35, 38, 45]": 1412, "[36, 40, 43, 48]": 1413, "[19, 34]": 1414, "[24, 28, 31, 40]": 1415, "[16, 28, 30]": 1416, "[31, 35, 38, 43, 47]": 1417, "[16, 31, 40]": 1418, "[51, 56]": 1419, "[38, 39, 42]": 1420, "[35, 37, 39]": 1421, "[26, 38]": 1422, "[44, 51, 56]": 1423, "[46, 56]": 1424, "[15, 56]": 1425, "[41, 44, 53]": 1426, "[3, 15, 27, 51]": 1427, "[46, 51]": 1428, "[44, 51, 53, 56, 63]": 1429, "[44, 46, 48]": 1430, "[43, 46]": 1431, "[8, 46]": 1432, "[27, 34, 39]": 1433, "[22, 34, 41]": 1434, "[41, 46]": 1435, "[36, 46]": 1436, "[41, 43, 45]": 1437, "[42, 54, 56]": 1438, "[12, 36, 39, 41, 45]": 1439, "[24, 29, 33, 36, 38]": 1440, "[22, 24, 31, 34, 36]": 1441, "[24, 34, 36]": 1442, "[24, 31, 34, 36]": 1443, "[13, 25, 32, 37]": 1444, "[13, 37, 44, 53]": 1445, "[30, 32, 42]": 1446, "[27, 30, 34, 37, 39, 42]": 1447, "[30, 34, 37, 39, 42]": 1448, "[27, 37]": 1449, "[32, 34, 44]": 1450, "[30, 37, 42]": 1451, "[53, 55]": 1452, "[36, 37, 40]": 1453, "[10, 34, 39, 46]": 1454, "[34, 38, 41, 46]": 1455, "[20, 27, 32, 39, 44]": 1456, "[20, 27, 32, 39]": 1457, "[27, 32, 44, 48]": 1458, "[32, 44, 48]": 1459, "[31, 34]": 1460, "[36, 40, 43, 45, 48]": 1461, "[36, 39, 43, 46, 48]": 1462, "[21, 26, 50]": 1463, "[10, 34, 38, 40]": 1464, "[10, 34, 41]": 1465, "[41, 42]": 1466, "[36, 37, 41]": 1467, "[15, 41]": 1468, "[45, 53, 57, 65]": 1469, "[53, 60, 65]": 1470, "[57, 63]": 1471, "[55, 62, 67]": 1472, "[48, 67]": 1473, "[20, 28, 32, 35]": 1474, "[55, 57]": 1475, "[5, 17]": 1476, "[39, 44]": 1477, "[36, 39, 48]": 1478, "[31, 43, 45]": 1479, "[33, 35, 38, 42, 45]": 1480, "[26, 33, 35, 38, 45, 47]": 1481, "[4, 16]": 1482, "[28, 31, 43]": 1483, "[28, 45]": 1484, "[24, 38]": 1485, "[19, 21]": 1486, "[14, 48]": 1487, "[19, 53]": 1488, "[7, 31]": 1489, "[30, 36]": 1490, "[34, 37, 41, 43]": 1491, "[34, 36, 46]": 1492, "[51, 60]": 1493, "[36, 44, 51]": 1494, "[44, 51]": 1495, "[34, 37, 41, 44, 46]": 1496, "[27, 34]": 1497, "[32, 36, 41, 44]": 1498, "[34, 39, 43, 46]": 1499, "[32, 34, 39, 44]": 1500, "[28, 33, 37]": 1501, "[33, 37]": 1502, "[26, 33]": 1503, "[9, 33]": 1504, "[21, 26, 33]": 1505, "[14, 21, 26, 33]": 1506, "[14, 21, 26]": 1507, "[21, 26]": 1508, "[14, 26, 31]": 1509, "[34, 37, 44]": 1510, "[36, 39, 42]": 1511, "[44, 47, 51, 56, 63]": 1512, "[6]": 1513, "[7, 29]": 1514, "[34, 46, 48, 53]": 1515, "[24, 26, 29, 33]": 1516, "[52, 55]": 1517, "[33, 37, 42]": 1518, "[27, 35]": 1519, "[26, 30, 33, 45]": 1520, "[30, 33, 38, 42, 45]": 1521, "[28, 32]": 1522, "[23, 30, 33, 35, 37, 38, 42]": 1523, "[41, 48]": 1524, "[29, 33, 36, 41, 45, 48]": 1525, "[33, 41, 48]": 1526, "[34, 46, 53]": 1527, "[46, 55]": 1528, "[34, 36, 48, 55]": 1529, "[34, 55]": 1530, "[26, 31]": 1531, "[28, 31, 33]": 1532, "[15, 27]": 1533, "[33, 45, 51]": 1534, "[3, 11, 15]": 1535, "[9, 21, 33, 34, 45, 46]": 1536, "[26, 33, 37, 38, 42]": 1537, "[26, 37, 45, 50]": 1538, "[33, 38, 45]": 1539, "[33, 38, 42, 45]": 1540, "[33, 38, 40, 45]": 1541, "[33, 38, 42, 45, 50]": 1542, "[38, 40, 42]": 1543, "[37, 38, 42, 45]": 1544, "[30, 33, 38, 45, 47]": 1545, "[42, 45, 54]": 1546, "[38, 40, 50, 52]": 1547, "[33, 38, 42, 45, 50, 52, 54]": 1548, "[31, 35, 47]": 1549, "[33, 40, 42, 45, 52]": 1550, "[27, 33]": 1551, "[35, 37, 42, 49]": 1552, "[21, 37, 45]": 1553, "[38, 47]": 1554, "[21, 45]": 1555, "[33, 40, 45]": 1556, "[14, 37, 38, 42, 45]": 1557, "[23, 28, 35]": 1558, "[34, 37, 39, 42]": 1559, "[34, 40, 44]": 1560, "[35, 39, 42, 47]": 1561, "[37, 42, 47, 49]": 1562, "[44, 46, 48, 52]": 1563, "[42, 46]": 1564, "[37, 42, 44, 47, 54]": 1565, "[42, 44, 46]": 1566, "[47, 52]": 1567, "[44, 56]": 1568, "[28, 33, 40]": 1569, "[18, 28, 33, 37, 40]": 1570, "[27, 28, 34, 37, 40]": 1571, "[19, 28, 31, 34, 37, 40, 43]": 1572, "[20, 23, 32, 39, 42, 44, 47]": 1573, "[30, 37, 42, 44]": 1574, "[29, 35, 37, 41, 44]": 1575, "[28, 32, 33, 37, 40]": 1576, "[30, 35, 37, 42]": 1577, "[29, 35, 41]": 1578, "[25, 32, 35, 37, 41]": 1579, "[24, 33]": 1580, "[23, 35, 37]": 1581, "[23, 33, 35, 37]": 1582, "[28, 33, 37, 40, 45]": 1583, "[28, 33, 35, 40]": 1584, "[27, 33, 36, 39, 45]": 1585, "[9, 48]": 1586, "[2, 14, 38, 42]": 1587, "[61, 64]": 1588, "[9, 16, 21, 40]": 1589, "[29, 34]": 1590, "[29, 30]": 1591, "[45, 49]": 1592, "[65, 66]": 1593, "[40, 43, 52]": 1594, "[35, 38, 47]": 1595, "[35, 52]": 1596, "[40, 43, 45, 52]": 1597, "[40, 43, 45, 55]": 1598, "[33, 45, 55]": 1599, "[31, 33, 38, 40, 45]": 1600, "[29, 47]": 1601, "[28, 38, 40, 46]": 1602, "[47, 51]": 1603, "[44, 49]": 1604, "[54, 61]": 1605, "[36, 39, 44, 48]": 1606, "[34, 39, 41, 46]": 1607, "[10, 22, 34, 38, 46]": 1608, "[32, 39, 44]": 1609, "[15, 34]": 1610, "[50, 52]": 1611, "[44, 52]": 1612, "[27, 39]": 1613, "[37, 46, 49]": 1614, "[37, 39, 42, 45, 51]": 1615, "[51, 55]": 1616, "[24, 32, 34, 36, 42, 44]": 1617, "[24, 34, 36, 42]": 1618, "[15, 32, 39, 44]": 1619, "[44, 53]": 1620, "[5, 34]": 1621, "[3]": 1622, "[29, 33, 45]": 1623, "[41, 45, 53]": 1624, "[33, 41]": 1625, "[27, 29]": 1626, "[27, 40]": 1627, "[29, 37, 41]": 1628, "[24, 27]": 1629, "[21, 22, 34, 37]": 1630, "[50, 62]": 1631, "[42, 57]": 1632, "[50, 59]": 1633, "[40, 49, 52]": 1634, "[14, 26, 29, 33, 38, 41, 45]": 1635, "[24, 28, 31, 36]": 1636, "[24, 28, 31, 36, 40, 43]": 1637, "[12, 24, 28, 31, 33, 36, 40]": 1638, "[14, 26, 29, 31]": 1639, "[23, 35, 39, 42]": 1640, "[23, 35, 37, 39]": 1641, "[23, 30, 32, 35, 42]": 1642, "[23, 30, 33, 35, 42]": 1643, "[30, 35]": 1644, "[23, 30, 35]": 1645, "[30, 34, 35, 39, 42]": 1646, "[27, 30, 35, 39, 42]": 1647, "[63, 65]": 1648, "[34, 37, 41, 46]": 1649, "[28, 36]": 1650, "[30, 35, 39, 42, 47]": 1651, "[37, 40, 45, 49]": 1652, "[30, 34, 37, 42, 46, 49]": 1653, "[32, 35, 39, 42, 44, 47]": 1654, "[30, 32, 35, 39, 42, 44]": 1655, "[34, 35]": 1656, "[18, 34, 42, 46]": 1657, "[32, 35, 37, 44]": 1658, "[35, 37, 42, 47]": 1659, "[35, 42, 47]": 1660, "[11, 23, 30, 35, 42]": 1661, "[6, 18, 30, 34, 37, 42, 46]": 1662, "[4, 16, 28, 40, 42, 44]": 1663, "[13, 30, 34, 37, 39, 42]": 1664, "[35, 42, 47, 51, 54]": 1665, "[6, 18, 30, 34, 37, 42, 44]": 1666, "[35, 40, 44, 56]": 1667, "[40, 42, 44, 46, 54]": 1668, "[28, 40, 42, 44, 46, 54]": 1669, "[43, 44, 47]": 1670, "[48, 57]": 1671, "[52, 55, 64]": 1672, "[48, 52, 58, 63]": 1673, "[48, 52, 58, 60, 63]": 1674, "[42, 46, 48]": 1675, "[39, 42, 44, 47]": 1676, "[36, 39, 42, 48]": 1677, "[41, 53]": 1678, "[42, 54]": 1679, "[48, 53]": 1680, "[34, 46, 49]": 1681, "[34, 41, 46, 51, 53]": 1682, "[39, 42, 44, 48, 54]": 1683, "[34, 37, 41, 42]": 1684, "[37, 41, 44, 48, 49, 53]": 1685, "[28, 31, 35, 40]": 1686, "[28, 35, 40, 42]": 1687, "[28, 30, 36]": 1688, "[31, 40, 43]": 1689, "[50, 57]": 1690, "[34, 35, 38]": 1691, "[9, 14, 21, 23, 26, 33, 35]": 1692, "[35, 49]": 1693, "[9, 21, 37, 40]": 1694, "[49, 57, 61]": 1695, "[34, 41, 45]": 1696, "[10, 22, 34]": 1697, "[28, 31, 34, 40]": 1698, "[16, 28, 33]": 1699, "[17, 26, 29, 33]": 1700, "[14, 26, 29, 33]": 1701, "[14, 53]": 1702, "[10, 22, 34, 38, 43]": 1703, "[24, 43]": 1704, "[21, 25]": 1705, "[21, 25, 28, 43, 45]": 1706, "[14, 21, 26, 38]": 1707, "[21, 36, 45, 48]": 1708, "[22, 41, 46, 50, 53]": 1709, "[21, 33, 37]": 1710, "[15, 27, 34]": 1711, "[54, 57]": 1712, "[14, 23, 26]": 1713, "[24, 40]": 1714, "[24, 31, 35, 36, 40, 43]": 1715, "[24, 31, 35, 36, 40, 43, 47]": 1716, "[11, 33]": 1717, "[11, 42]": 1718, "[11, 39, 42]": 1719, "[28, 35, 39, 40, 47]": 1720, "[28, 35, 40, 43, 47]": 1721, "[35, 39, 47]": 1722, "[26, 35, 43, 47]": 1723, "[35, 36, 39, 43]": 1724, "[21, 33, 35, 39, 42]": 1725, "[47, 55]": 1726, "[9, 12]": 1727, "[23, 47, 54]": 1728, "[40, 47]": 1729, "[12, 21]": 1730, "[32, 37, 39, 44]": 1731, "[37, 39, 44, 51]": 1732, "[14, 26, 38]": 1733, "[11, 23, 35]": 1734, "[35, 38, 41, 44]": 1735, "[36, 38, 48]": 1736, "[12, 55, 60]": 1737, "[9, 21, 55, 57, 62]": 1738, "[20, 27]": 1739, "[8]": 1740, "[16, 51]": 1741, "[34, 48]": 1742, "[3, 15]": 1743, "[28, 31, 34, 36]": 1744, "[3, 31]": 1745, "[29, 33, 34, 41]": 1746, "[29, 33, 34, 41, 45]": 1747, "[33, 34]": 1748, "[9, 21, 31, 33]": 1749, "[9, 31, 33]": 1750, "[34, 37, 40, 46]": 1751, "[37, 41, 44, 49]": 1752, "[32, 34, 37, 41, 44]": 1753, "[32, 36, 39, 44, 51]": 1754, "[32, 36, 39, 44, 51, 53]": 1755, "[36, 39, 41, 44, 48]": 1756, "[36, 41, 44, 53]": 1757, "[34, 49]": 1758, "[34, 37, 49]": 1759, "[42, 44, 54]": 1760, "[40, 44, 45, 52]": 1761, "[42, 52]": 1762, "[33, 42, 45]": 1763, "[43, 45, 47]": 1764, "[51, 54]": 1765, "[16, 28, 35]": 1766, "[9, 37]": 1767, "[28, 35, 45, 47]": 1768, "[28, 42, 52]": 1769, "[28, 50, 52]": 1770, "[45, 49, 57]": 1771, "[28, 32, 37, 40, 44]": 1772, "[32, 37, 44, 49]": 1773, "[18, 34, 37, 40, 42, 46]": 1774, "[18, 34, 37, 42]": 1775, "[30, 34]": 1776, "[32, 37, 40]": 1777, "[11, 23, 39, 42]": 1778, "[23, 39, 42]": 1779, "[6, 37]": 1780, "[25, 32, 37, 40, 44]": 1781, "[32, 37, 40, 44]": 1782, "[33, 34, 45, 46]": 1783, "[47, 50, 52]": 1784, "[48, 49, 52]": 1785, "[22, 34, 38]": 1786, "[24, 34]": 1787, "[10, 22, 34, 38]": 1788, "[10, 34, 46]": 1789, "[10, 34]": 1790, "[26, 31, 38, 43]": 1791, "[12, 24, 36]": 1792, "[12, 24, 34]": 1793, "[34, 42, 43]": 1794, "[12, 36]": 1795, "[12, 24, 36, 41]": 1796, "[24, 36, 41]": 1797, "[24, 36, 38, 41]": 1798, "[10, 22, 38]": 1799, "[22, 34, 36]": 1800, "[10, 22, 32, 34]": 1801, "[39, 47]": 1802, "[33, 55]": 1803, "[21, 23, 25, 27, 37, 47]": 1804, "[40, 47, 48, 52]": 1805, "[24, 27, 47, 48, 51]": 1806, "[27, 51]": 1807, "[17, 29]": 1808, "[32, 44, 51, 53]": 1809, "[25, 32, 37, 44, 51]": 1810, "[25, 32, 37, 41, 44]": 1811, "[22, 29, 32, 37, 41, 44]": 1812, "[22, 29, 32, 37, 41, 44, 46]": 1813, "[22, 29, 32, 34, 37, 41, 44]": 1814, "[22, 34, 44, 46, 51]": 1815, "[1, 37, 41]": 1816, "[1, 30, 37, 42]": 1817, "[1, 37]": 1818, "[43, 48]": 1819, "[31, 51]": 1820, "[46, 55, 58]": 1821, "[42, 44, 51]": 1822, "[39, 42, 44]": 1823, "[9, 21, 40, 45]": 1824, "[29, 36, 39, 44]": 1825, "[26, 34, 38, 40, 44]": 1826, "[9, 21, 33, 37, 40, 44]": 1827, "[47, 48, 51]": 1828, "[9, 35]": 1829, "[23, 28, 35, 40]": 1830, "[25, 33, 45]": 1831, "[9, 45, 47]": 1832, "[41, 45, 47]": 1833, "[28, 33, 35, 47]": 1834, "[36, 38, 45, 48, 50]": 1835, "[16, 28, 40]": 1836, "[9, 21, 43, 45]": 1837, "[12, 48, 51]": 1838, "[14, 26, 36]": 1839, "[12, 48]": 1840, "[12, 24, 31, 36]": 1841, "[3, 15, 36, 39]": 1842, "[14, 26, 34, 36]": 1843, "[34, 36, 38, 41, 48, 53, 55]": 1844, "[45, 48, 50]": 1845, "[3, 15, 51, 55]": 1846, "[50, 54]": 1847, "[33, 45, 50, 54]": 1848, "[41, 48, 53, 55]": 1849, "[15, 55]": 1850, "[34, 36, 48]": 1851, "[14, 33, 38, 41, 45, 48, 50]": 1852, "[9, 21, 45, 48, 53]": 1853, "[9, 21, 36, 41, 45, 48, 50]": 1854, "[10, 22, 34, 36, 38, 46]": 1855, "[9, 43, 45]": 1856, "[34, 36, 39, 43, 46, 48]": 1857, "[10, 22, 29, 34]": 1858, "[20, 27, 32, 34, 44]": 1859, "[27, 29, 41]": 1860, "[22, 27, 34, 39]": 1861, "[31, 34, 36, 39, 43]": 1862, "[29, 34, 39, 41, 46]": 1863, "[22, 26, 34, 38]": 1864, "[22, 29, 32, 34]": 1865, "[31, 35, 38, 43]": 1866, "[29, 33, 36, 41, 45]": 1867, "[31, 36, 38, 43]": 1868, "[36, 37]": 1869, "[33, 36, 38]": 1870, "[19, 23, 26, 31, 35, 38]": 1871, "[19, 23, 26, 31, 35]": 1872, "[19, 23, 26, 31, 33, 35]": 1873, "[9, 21, 33, 36]": 1874, "[9, 21, 33, 36, 40, 41]": 1875, "[9, 21, 33, 37, 40]": 1876, "[7, 19, 35]": 1877, "[7, 19, 35, 41, 43]": 1878, "[17, 24, 29, 33, 41]": 1879, "[17, 33, 41]": 1880, "[33, 39, 43]": 1881, "[7, 19, 35, 38, 40]": 1882, "[11, 23, 35, 38]": 1883, "[11, 23, 35, 37]": 1884, "[21, 28, 33, 36]": 1885, "[21, 28, 33, 36, 40]": 1886, "[21, 33, 35, 37]": 1887, "[7, 19, 35, 38]": 1888, "[35, 39, 41]": 1889, "[38, 41, 43]": 1890, "[48, 56]": 1891, "[32, 44, 48, 51]": 1892, "[44, 48, 56, 57]": 1893, "[32, 39, 41]": 1894, "[37, 44, 53, 56]": 1895, "[21, 26, 31]": 1896, "[26, 31, 35, 38, 42, 43]": 1897, "[31, 35, 38, 42, 43]": 1898, "[24, 31, 36, 38, 43]": 1899, "[24, 31, 33, 36, 40, 43]": 1900, "[31, 33, 35]": 1901, "[21, 23, 31, 33, 35]": 1902, "[23, 31, 38, 43]": 1903, "[31, 33, 38, 43]": 1904, "[16, 28, 31, 34, 38, 43]": 1905, "[28, 31, 33, 43, 45]": 1906, "[12, 24, 31, 34, 36]": 1907, "[31, 33, 43, 45]": 1908, "[35, 41, 47]": 1909, "[28, 31, 35, 36, 40, 43]": 1910, "[28, 31, 40, 43]": 1911, "[28, 31, 35, 36, 40]": 1912, "[31, 45]": 1913, "[28, 43]": 1914, "[28, 36, 40, 42]": 1915, "[31, 36, 40, 43]": 1916, "[28, 31, 35]": 1917, "[28, 31, 35, 43]": 1918, "[9, 12, 16, 45]": 1919, "[54, 56]": 1920, "[30, 42, 46, 51]": 1921, "[15, 22, 27, 32, 39]": 1922, "[15, 22, 32, 34, 39]": 1923, "[13, 20, 22, 29, 32, 34]": 1924, "[22, 28, 32, 34]": 1925, "[15, 22, 27, 31, 34]": 1926, "[17, 24, 29, 32, 36, 44]": 1927, "[24, 32, 34, 36, 44]": 1928, "[22, 27, 31, 34, 36]": 1929, "[10, 22, 27]": 1930, "[3, 27]": 1931, "[23, 26, 30]": 1932, "[32, 40]": 1933, "[35, 53]": 1934, "[33, 57]": 1935, "[37, 42, 51, 54]": 1936, "[34, 37, 42, 46, 49]": 1937, "[24, 33, 36, 45]": 1938, "[12, 24, 33, 36, 43, 45]": 1939, "[33, 36, 40, 45]": 1940, "[12, 36, 38]": 1941, "[31, 36, 43]": 1942, "[31, 34, 36, 43]": 1943, "[21, 28, 33, 40]": 1944, "[28, 30]": 1945, "[26, 30, 38]": 1946, "[9, 30, 33]": 1947, "[22, 34, 39]": 1948, "[24, 36, 46]": 1949, "[37, 40, 44, 45]": 1950, "[33, 35, 37]": 1951, "[48, 57, 60]": 1952, "[33, 45, 48]": 1953, "[21, 33, 36, 43, 45]": 1954, "[31, 35, 40, 42, 43, 45, 47]": 1955, "[7, 35, 38, 43]": 1956, "[31, 37, 43]": 1957, "[33, 38, 41, 45]": 1958, "[7, 9, 36, 40, 43, 45]": 1959, "[33, 36, 38, 45]": 1960, "[33, 35, 36, 43, 45, 48]": 1961, "[33, 41, 43]": 1962, "[24, 33, 36, 38]": 1963, "[23, 24, 35, 36]": 1964, "[24, 36, 43]": 1965, "[19, 43]": 1966, "[26, 38, 40]": 1967, "[24, 29, 33, 36]": 1968, "[24, 29, 33, 36, 38, 41, 45]": 1969, "[24, 36, 40, 43, 45]": 1970, "[24, 26, 36, 38, 45]": 1971, "[36, 39, 42, 44]": 1972, "[21, 26, 33, 36, 38, 41]": 1973, "[21, 24, 26, 33, 36, 38, 41]": 1974, "[21, 26, 45]": 1975, "[21, 26, 38, 41, 45]": 1976, "[21, 24, 26, 41]": 1977, "[24, 26, 36]": 1978, "[24, 26, 36, 38]": 1979, "[21, 24, 26, 29, 33, 36, 38]": 1980, "[21, 26, 29, 33, 36, 38, 40]": 1981, "[26, 29, 33, 36, 38, 40]": 1982, "[26, 50]": 1983, "[4]": 1984, "[24, 40, 43, 45, 48]": 1985, "[24, 40, 43]": 1986, "[8, 20, 32]": 1987, "[5, 10, 17, 29, 32, 34, 37]": 1988, "[8, 20, 36]": 1989, "[15, 27, 34, 43]": 1990, "[5, 17, 29, 36, 41, 44]": 1991, "[17, 29, 36, 41, 44]": 1992, "[24, 32, 36]": 1993, "[15, 22, 34, 43]": 1994, "[6, 34, 37]": 1995, "[6, 18, 34, 37]": 1996, "[8, 20, 27]": 1997, "[8, 20, 56]": 1998, "[15, 22, 27]": 1999, "[17, 56]": 2000, "[15, 22]": 2001, "[17, 29, 32]": 2002, "[8, 27]": 2003, "[13, 20]": 2004, "[15, 34, 37, 39, 43]": 2005, "[23, 31, 35, 38, 43]": 2006, "[19, 38]": 2007, "[26, 35, 42, 45]": 2008, "[26, 35, 36, 42, 45, 48]": 2009, "[26, 36, 45, 48]": 2010, "[35, 45, 47, 53]": 2011, "[12, 24, 26, 38]": 2012, "[21, 26, 33, 36, 38]": 2013, "[26, 33, 38, 42, 45]": 2014, "[9, 16, 28, 33]": 2015, "[21, 26, 38]": 2016, "[28, 32, 35, 40, 44]": 2017, "[16, 48]": 2018, "[28, 35, 40, 44, 47]": 2019, "[9, 21, 45]": 2020, "[32, 41]": 2021, "[35, 43, 45]": 2022, "[27, 32, 39]": 2023, "[45, 52, 61]": 2024, "[34, 39, 42]": 2025, "[37, 48]": 2026, "[39, 48]": 2027, "[59, 62]": 2028, "[56, 60]": 2029, "[65, 68]": 2030, "[43, 47]": 2031, "[3, 15, 27]": 2032, "[3, 15, 27, 33, 45]": 2033, "[37, 41, 42, 45]": 2034, "[31, 36, 48]": 2035, "[17, 41, 45]": 2036, "[12, 29, 36, 45]": 2037, "[38, 46]": 2038, "[25, 27, 32, 37, 39, 44]": 2039, "[40, 43, 45]": 2040, "[36, 45, 48]": 2041, "[36, 40, 48]": 2042, "[7, 12, 19]": 2043, "[34, 40, 46]": 2044, "[52, 57]": 2045, "[29, 30, 34]": 2046, "[27, 30, 35, 44]": 2047, "[27, 30]": 2048, "[12, 13]": 2049, "[26, 31, 33, 38]": 2050, "[8, 9]": 2051, "[54, 69]": 2052, "[16, 24]": 2053, "[32, 36, 39, 41]": 2054, "[31, 40]": 2055, "[29, 36, 41, 48]": 2056, "[28, 48]": 2057, "[40, 45, 48, 52]": 2058, "[48, 52, 55, 67]": 2059, "[43, 48, 52, 55, 64, 67]": 2060, "[43, 48, 52, 55]": 2061, "[44, 48, 55, 56, 58]": 2062, "[45, 54]": 2063, "[41, 44, 46]": 2064, "[41, 60]": 2065, "[41, 56]": 2066, "[41, 56, 60, 65]": 2067, "[44, 48, 56, 60, 65]": 2068, "[44, 48, 56, 60]": 2069, "[43, 46, 48, 58]": 2070, "[46, 58]": 2071, "[46, 58, 60]": 2072, "[40, 58]": 2073, "[40, 46, 58]": 2074, "[46, 48, 58]": 2075, "[44, 48, 56]": 2076, "[38, 44, 56]": 2077, "[44, 56, 60, 65, 68]": 2078, "[44, 56, 60]": 2079, "[36, 48, 60]": 2080, "[36, 44, 48]": 2081, "[36, 44, 48, 60]": 2082, "[36, 44, 48, 56]": 2083, "[66, 70]": 2084, "[49, 61, 66, 70]": 2085, "[49, 61, 66]": 2086, "[49, 61, 66, 70, 73, 82]": 2087, "[49, 61, 66, 70, 73, 82, 84]": 2088, "[61, 66, 70, 73]": 2089, "[63, 73]": 2090, "[56, 63, 68, 72, 75]": 2091, "[56, 63, 68, 72, 75, 80]": 2092, "[56, 68, 72, 75]": 2093, "[56, 68, 72]": 2094, "[56, 68, 72, 77]": 2095, "[77]": 2096, "[73, 77]": 2097, "[58, 77, 80, 82]": 2098, "[58, 73, 77, 80, 82]": 2099, "[58, 73, 82]": 2100, "[82]": 2101, "[73, 82]": 2102, "[84]": 2103, "[56, 63]": 2104, "[56, 63, 72]": 2105, "[56, 63, 68, 72]": 2106, "[72]": 2107, "[42, 77]": 2108, "[42, 54, 61, 70, 73, 82]": 2109, "[61, 70, 73, 80, 82]": 2110, "[61, 70, 80, 82]": 2111, "[42, 78, 82]": 2112, "[61, 77, 78, 82]": 2113, "[77, 80]": 2114, "[77, 80, 84]": 2115, "[77, 84]": 2116, "[56, 75, 84]": 2117, "[63, 75, 77, 85]": 2118, "[63, 75, 85]": 2119, "[63, 72, 75]": 2120, "[63, 72, 75, 84]": 2121, "[56, 72, 75, 84]": 2122, "[56, 72, 75]": 2123, "[56, 72, 75, 80]": 2124, "[75, 80]": 2125, "[73, 75, 80]": 2126, "[46, 58, 75, 80, 82]": 2127, "[46, 58, 65, 75, 82, 84]": 2128, "[46, 58, 65, 82, 84]": 2129, "[46, 58, 65, 73, 80, 82]": 2130, "[58, 65, 73, 80, 82]": 2131, "[58, 65, 73, 80]": 2132, "[58, 65, 82, 84]": 2133, "[41, 57]": 2134, "[41, 48, 57, 60]": 2135, "[46, 62, 65]": 2136, "[46, 53, 62, 65]": 2137, "[50, 74]": 2138, "[50, 55, 58, 74]": 2139, "[55, 58, 63]": 2140, "[48, 55, 60, 84]": 2141, "[48, 55, 60, 63, 84]": 2142, "[48, 55, 60, 63, 75, 84]": 2143, "[46, 55, 58, 63, 70, 75]": 2144, "[46, 55, 58, 63, 70]": 2145, "[67, 74]": 2146, "[48, 55, 58, 67]": 2147, "[55, 58, 63, 67, 70, 74]": 2148, "[62, 65, 67]": 2149, "[46, 55, 62, 65, 67]": 2150, "[46, 55, 58, 62, 65]": 2151, "[44, 60, 63, 68]": 2152, "[44, 51, 56, 60, 63, 68]": 2153, "[44, 56, 60, 